results_load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 3m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/50 VUs  0m01.0s/3m30.0s

running (0m02.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m02.0s/3m30.0s

running (0m03.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
default   [   1% ] 03/50 VUs  0m03.0s/3m30.0s

running (0m04.0s), 04/50 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 04/50 VUs  0m04.0s/3m30.0s

running (0m05.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  0m05.0s/3m30.0s

running (0m06.0s), 05/50 VUs, 12 complete and 0 interrupted iterations
default   [   3% ] 05/50 VUs  0m06.0s/3m30.0s

running (0m07.0s), 06/50 VUs, 15 complete and 0 interrupted iterations
default   [   3% ] 06/50 VUs  0m07.0s/3m30.0s

running (0m08.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
default   [   4% ] 07/50 VUs  0m08.0s/3m30.0s

running (0m09.0s), 08/50 VUs, 28 complete and 0 interrupted iterations
default   [   4% ] 08/50 VUs  0m09.0s/3m30.0s

running (0m10.0s), 09/50 VUs, 35 complete and 0 interrupted iterations
default   [   5% ] 09/50 VUs  0m10.0s/3m30.0s

running (0m11.0s), 09/50 VUs, 42 complete and 0 interrupted iterations
default   [   5% ] 09/50 VUs  0m11.0s/3m30.0s

running (0m12.0s), 10/50 VUs, 46 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  0m12.0s/3m30.0s

running (0m13.0s), 11/50 VUs, 55 complete and 0 interrupted iterations
default   [   6% ] 11/50 VUs  0m13.0s/3m30.0s

running (0m14.0s), 12/50 VUs, 66 complete and 0 interrupted iterations
default   [   7% ] 12/50 VUs  0m14.0s/3m30.0s

running (0m15.0s), 13/50 VUs, 78 complete and 0 interrupted iterations
default   [   7% ] 13/50 VUs  0m15.0s/3m30.0s

running (0m16.0s), 14/50 VUs, 91 complete and 0 interrupted iterations
default   [   8% ] 14/50 VUs  0m16.0s/3m30.0s

running (0m17.0s), 14/50 VUs, 98 complete and 0 interrupted iterations
default   [   8% ] 14/50 VUs  0m17.0s/3m30.0s

running (0m18.0s), 15/50 VUs, 106 complete and 0 interrupted iterations
default   [   9% ] 15/50 VUs  0m18.0s/3m30.0s

running (0m19.0s), 16/50 VUs, 120 complete and 0 interrupted iterations
default   [   9% ] 16/50 VUs  0m19.0s/3m30.0s

running (0m20.0s), 17/50 VUs, 136 complete and 0 interrupted iterations
default   [  10% ] 17/50 VUs  0m20.0s/3m30.0s

running (0m21.0s), 18/50 VUs, 153 complete and 0 interrupted iterations
default   [  10% ] 18/50 VUs  0m21.0s/3m30.0s

running (0m22.0s), 18/50 VUs, 168 complete and 0 interrupted iterations
default   [  10% ] 18/50 VUs  0m22.0s/3m30.0s

running (0m23.0s), 19/50 VUs, 176 complete and 0 interrupted iterations
default   [  11% ] 19/50 VUs  0m23.0s/3m30.0s

running (0m24.0s), 20/50 VUs, 191 complete and 0 interrupted iterations
default   [  11% ] 20/50 VUs  0m24.0s/3m30.0s

running (0m25.0s), 21/50 VUs, 210 complete and 0 interrupted iterations
default   [  12% ] 21/50 VUs  0m25.0s/3m30.0s

running (0m26.0s), 22/50 VUs, 231 complete and 0 interrupted iterations
default   [  12% ] 22/50 VUs  0m26.0s/3m30.0s

running (0m27.0s), 23/50 VUs, 251 complete and 0 interrupted iterations
default   [  13% ] 23/50 VUs  0m27.0s/3m30.0s

running (0m28.0s), 23/50 VUs, 265 complete and 0 interrupted iterations
default   [  13% ] 23/50 VUs  0m28.0s/3m30.0s

running (0m29.0s), 24/50 VUs, 281 complete and 0 interrupted iterations
default   [  14% ] 24/50 VUs  0m29.0s/3m30.0s

running (0m30.0s), 25/50 VUs, 301 complete and 0 interrupted iterations
default   [  14% ] 25/50 VUs  0m30.0s/3m30.0s

running (0m31.0s), 26/50 VUs, 325 complete and 0 interrupted iterations
default   [  15% ] 26/50 VUs  0m31.0s/3m30.0s

running (0m32.0s), 27/50 VUs, 350 complete and 0 interrupted iterations
default   [  15% ] 27/50 VUs  0m32.0s/3m30.0s

running (0m33.0s), 27/50 VUs, 372 complete and 0 interrupted iterations
default   [  16% ] 27/50 VUs  0m33.0s/3m30.0s

running (0m34.0s), 28/50 VUs, 391 complete and 0 interrupted iterations
default   [  16% ] 28/50 VUs  0m34.0s/3m30.0s

running (0m35.0s), 29/50 VUs, 409 complete and 0 interrupted iterations
default   [  17% ] 29/50 VUs  0m35.0s/3m30.0s

running (0m36.0s), 30/50 VUs, 436 complete and 0 interrupted iterations
default   [  17% ] 30/50 VUs  0m36.0s/3m30.0s

running (0m37.0s), 31/50 VUs, 464 complete and 0 interrupted iterations
default   [  18% ] 31/50 VUs  0m37.0s/3m30.0s

running (0m38.0s), 32/50 VUs, 492 complete and 0 interrupted iterations
default   [  18% ] 32/50 VUs  0m38.0s/3m30.0s

running (0m39.0s), 32/50 VUs, 515 complete and 0 interrupted iterations
default   [  19% ] 32/50 VUs  0m39.0s/3m30.0s

running (0m40.0s), 33/50 VUs, 542 complete and 0 interrupted iterations
default   [  19% ] 33/50 VUs  0m40.0s/3m30.0s

running (0m41.0s), 34/50 VUs, 568 complete and 0 interrupted iterations
default   [  20% ] 34/50 VUs  0m41.0s/3m30.0s

running (0m42.0s), 35/50 VUs, 596 complete and 0 interrupted iterations
default   [  20% ] 35/50 VUs  0m42.0s/3m30.0s

running (0m43.0s), 36/50 VUs, 629 complete and 0 interrupted iterations
default   [  20% ] 36/50 VUs  0m43.0s/3m30.0s

running (0m44.0s), 36/50 VUs, 656 complete and 0 interrupted iterations
default   [  21% ] 36/50 VUs  0m44.0s/3m30.0s

running (0m45.0s), 37/50 VUs, 684 complete and 0 interrupted iterations
default   [  21% ] 37/50 VUs  0m45.0s/3m30.0s

running (0m46.0s), 38/50 VUs, 716 complete and 0 interrupted iterations
default   [  22% ] 38/50 VUs  0m46.0s/3m30.0s

running (0m47.0s), 39/50 VUs, 749 complete and 0 interrupted iterations
default   [  22% ] 39/50 VUs  0m47.0s/3m30.0s

running (0m48.0s), 40/50 VUs, 781 complete and 0 interrupted iterations
default   [  23% ] 40/50 VUs  0m48.0s/3m30.0s

running (0m49.0s), 41/50 VUs, 814 complete and 0 interrupted iterations
default   [  23% ] 41/50 VUs  0m49.0s/3m30.0s

running (0m50.0s), 41/50 VUs, 847 complete and 0 interrupted iterations
default   [  24% ] 41/50 VUs  0m50.0s/3m30.0s

running (0m51.0s), 42/50 VUs, 881 complete and 0 interrupted iterations
default   [  24% ] 42/50 VUs  0m51.0s/3m30.0s

running (0m52.0s), 43/50 VUs, 914 complete and 0 interrupted iterations
default   [  25% ] 43/50 VUs  0m52.0s/3m30.0s

running (0m53.0s), 44/50 VUs, 953 complete and 0 interrupted iterations
default   [  25% ] 44/50 VUs  0m53.0s/3m30.0s

running (0m54.0s), 45/50 VUs, 990 complete and 0 interrupted iterations
default   [  26% ] 45/50 VUs  0m54.0s/3m30.0s

running (0m55.0s), 45/50 VUs, 1025 complete and 0 interrupted iterations
default   [  26% ] 45/50 VUs  0m55.0s/3m30.0s

running (0m56.0s), 46/50 VUs, 1061 complete and 0 interrupted iterations
default   [  27% ] 46/50 VUs  0m56.0s/3m30.0s

running (0m57.0s), 47/50 VUs, 1099 complete and 0 interrupted iterations
default   [  27% ] 47/50 VUs  0m57.0s/3m30.0s

running (0m58.0s), 48/50 VUs, 1141 complete and 0 interrupted iterations
default   [  28% ] 48/50 VUs  0m58.0s/3m30.0s

running (0m59.0s), 49/50 VUs, 1180 complete and 0 interrupted iterations
default   [  28% ] 49/50 VUs  0m59.0s/3m30.0s

running (1m00.0s), 49/50 VUs, 1225 complete and 0 interrupted iterations
default   [  29% ] 49/50 VUs  1m00.0s/3m30.0s

running (1m01.0s), 50/50 VUs, 1261 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  1m01.0s/3m30.0s

running (1m02.0s), 50/50 VUs, 1301 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m02.0s/3m30.0s

running (1m03.0s), 50/50 VUs, 1344 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m03.0s/3m30.0s

running (1m04.0s), 50/50 VUs, 1386 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  1m04.0s/3m30.0s

running (1m05.0s), 50/50 VUs, 1429 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m05.0s/3m30.0s

running (1m06.0s), 50/50 VUs, 1473 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  1m06.0s/3m30.0s

running (1m07.0s), 50/50 VUs, 1514 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m07.0s/3m30.0s

running (1m08.0s), 50/50 VUs, 1549 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  1m08.0s/3m30.0s

running (1m09.0s), 50/50 VUs, 1592 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m09.0s/3m30.0s

running (1m10.0s), 50/50 VUs, 1634 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  1m10.0s/3m30.0s

running (1m11.0s), 50/50 VUs, 1678 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m11.0s/3m30.0s

running (1m12.0s), 50/50 VUs, 1722 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  1m12.0s/3m30.0s

running (1m13.0s), 50/50 VUs, 1759 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m13.0s/3m30.0s

running (1m14.0s), 50/50 VUs, 1800 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  1m14.0s/3m30.0s

running (1m15.0s), 50/50 VUs, 1842 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m15.0s/3m30.0s

running (1m16.0s), 50/50 VUs, 1886 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  1m16.0s/3m30.0s

running (1m17.0s), 50/50 VUs, 1930 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m17.0s/3m30.0s

running (1m18.0s), 50/50 VUs, 1970 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  1m18.0s/3m30.0s

running (1m19.0s), 50/50 VUs, 2011 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m19.0s/3m30.0s

running (1m20.0s), 50/50 VUs, 2050 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  1m20.0s/3m30.0s

running (1m21.0s), 50/50 VUs, 2093 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m21.0s/3m30.0s

running (1m22.0s), 50/50 VUs, 2139 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  1m22.0s/3m30.0s

running (1m23.0s), 50/50 VUs, 2178 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m23.0s/3m30.0s

running (1m24.0s), 50/50 VUs, 2217 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m24.0s/3m30.0s

running (1m25.0s), 50/50 VUs, 2257 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m25.0s/3m30.0s

running (1m26.0s), 50/50 VUs, 2301 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m26.0s/3m30.0s

running (1m27.0s), 50/50 VUs, 2342 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m27.0s/3m30.0s

running (1m28.0s), 50/50 VUs, 2384 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  1m28.0s/3m30.0s

running (1m29.0s), 50/50 VUs, 2426 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  1m29.0s/3m30.0s

running (1m30.0s), 50/50 VUs, 2467 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m30.0s/3m30.0s

running (1m31.0s), 50/50 VUs, 2506 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m31.0s/3m30.0s

running (1m32.0s), 50/50 VUs, 2547 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  1m32.0s/3m30.0s

running (1m33.0s), 50/50 VUs, 2591 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  1m33.0s/3m30.0s

running (1m34.0s), 50/50 VUs, 2635 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  1m34.0s/3m30.0s

running (1m35.0s), 50/50 VUs, 2675 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  1m35.0s/3m30.0s

running (1m36.0s), 50/50 VUs, 2716 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  1m36.0s/3m30.0s

running (1m37.0s), 50/50 VUs, 2756 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  1m37.0s/3m30.0s

running (1m38.0s), 50/50 VUs, 2798 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m38.0s/3m30.0s

running (1m39.0s), 50/50 VUs, 2841 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m39.0s/3m30.0s

running (1m40.0s), 50/50 VUs, 2883 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  1m40.0s/3m30.0s

running (1m41.0s), 50/50 VUs, 2927 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  1m41.0s/3m30.0s

running (1m42.0s), 50/50 VUs, 2968 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m42.0s/3m30.0s

running (1m43.0s), 50/50 VUs, 3006 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m43.0s/3m30.0s

running (1m44.0s), 50/50 VUs, 3047 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  1m44.0s/3m30.0s

running (1m45.0s), 50/50 VUs, 3090 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  1m45.0s/3m30.0s

running (1m46.0s), 50/50 VUs, 3134 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  1m46.0s/3m30.0s

running (1m47.0s), 50/50 VUs, 3175 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m47.0s/3m30.0s

running (1m48.0s), 50/50 VUs, 3218 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m48.0s/3m30.0s

running (1m49.0s), 50/50 VUs, 3258 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m49.0s/3m30.0s

running (1m50.0s), 50/50 VUs, 3296 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m50.0s/3m30.0s

running (1m51.0s), 50/50 VUs, 3340 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m51.0s/3m30.0s

running (1m52.0s), 50/50 VUs, 3383 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m52.0s/3m30.0s

running (1m53.0s), 50/50 VUs, 3425 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m53.0s/3m30.0s

running (1m54.0s), 50/50 VUs, 3466 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m54.0s/3m30.0s

running (1m55.0s), 50/50 VUs, 3508 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  1m55.0s/3m30.0s

running (1m56.0s), 50/50 VUs, 3547 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  1m56.0s/3m30.0s

running (1m57.0s), 50/50 VUs, 3590 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m57.0s/3m30.0s

running (1m58.0s), 50/50 VUs, 3633 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m58.0s/3m30.0s

running (1m59.0s), 50/50 VUs, 3673 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m59.0s/3m30.0s

running (2m00.0s), 50/50 VUs, 3718 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m00.0s/3m30.0s

running (2m01.0s), 50/50 VUs, 3756 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m01.0s/3m30.0s

running (2m02.0s), 50/50 VUs, 3794 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m02.0s/3m30.0s

running (2m03.0s), 50/50 VUs, 3837 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m03.0s/3m30.0s

running (2m04.0s), 50/50 VUs, 3884 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m04.0s/3m30.0s

running (2m05.0s), 50/50 VUs, 3925 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m05.0s/3m30.0s

running (2m06.0s), 50/50 VUs, 3968 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m06.0s/3m30.0s

running (2m07.0s), 50/50 VUs, 4006 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m07.0s/3m30.0s

running (2m08.0s), 50/50 VUs, 4043 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  2m08.0s/3m30.0s

running (2m09.0s), 50/50 VUs, 4088 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  2m09.0s/3m30.0s

running (2m10.0s), 50/50 VUs, 4132 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  2m10.0s/3m30.0s

running (2m11.0s), 50/50 VUs, 4174 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  2m11.0s/3m30.0s

running (2m12.0s), 50/50 VUs, 4214 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  2m12.0s/3m30.0s

running (2m13.0s), 50/50 VUs, 4253 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  2m13.0s/3m30.0s

running (2m14.0s), 50/50 VUs, 4295 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  2m14.0s/3m30.0s

running (2m15.0s), 50/50 VUs, 4337 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  2m15.0s/3m30.0s

running (2m16.0s), 50/50 VUs, 4383 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  2m16.0s/3m30.0s

running (2m17.0s), 50/50 VUs, 4426 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  2m17.0s/3m30.0s

running (2m18.0s), 50/50 VUs, 4463 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  2m18.0s/3m30.0s

running (2m19.0s), 50/50 VUs, 4503 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  2m19.0s/3m30.0s

running (2m20.0s), 50/50 VUs, 4547 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m20.0s/3m30.0s

running (2m21.0s), 50/50 VUs, 4589 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  2m21.0s/3m30.0s

running (2m22.0s), 50/50 VUs, 4632 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m22.0s/3m30.0s

running (2m23.0s), 50/50 VUs, 4673 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  2m23.0s/3m30.0s

running (2m24.0s), 50/50 VUs, 4716 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m24.0s/3m30.0s

running (2m25.0s), 50/50 VUs, 4752 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  2m25.0s/3m30.0s

running (2m26.0s), 50/50 VUs, 4795 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  2m26.0s/3m30.0s

running (2m27.0s), 50/50 VUs, 4840 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  2m27.0s/3m30.0s

running (2m28.0s), 50/50 VUs, 4881 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  2m28.0s/3m30.0s

running (2m29.0s), 50/50 VUs, 4924 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m29.0s/3m30.0s

running (2m30.0s), 50/50 VUs, 4965 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  2m30.0s/3m30.0s

running (2m31.0s), 50/50 VUs, 5003 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m31.0s/3m30.0s

running (2m32.0s), 50/50 VUs, 5046 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  2m32.0s/3m30.0s

running (2m33.0s), 50/50 VUs, 5087 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m33.0s/3m30.0s

running (2m34.0s), 50/50 VUs, 5129 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  2m34.0s/3m30.0s

running (2m35.0s), 50/50 VUs, 5174 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m35.0s/3m30.0s

running (2m36.0s), 50/50 VUs, 5209 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  2m36.0s/3m30.0s

running (2m37.0s), 50/50 VUs, 5251 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  2m37.0s/3m30.0s

running (2m38.0s), 50/50 VUs, 5296 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  2m38.0s/3m30.0s

running (2m39.0s), 50/50 VUs, 5336 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m39.0s/3m30.0s

running (2m40.0s), 50/50 VUs, 5379 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  2m40.0s/3m30.0s

running (2m41.0s), 50/50 VUs, 5420 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m41.0s/3m30.0s

running (2m42.0s), 50/50 VUs, 5460 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  2m42.0s/3m30.0s

running (2m43.0s), 50/50 VUs, 5500 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m43.0s/3m30.0s

running (2m44.0s), 50/50 VUs, 5547 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  2m44.0s/3m30.0s

running (2m45.0s), 50/50 VUs, 5589 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m45.0s/3m30.0s

running (2m46.0s), 50/50 VUs, 5629 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  2m46.0s/3m30.0s

running (2m47.0s), 50/50 VUs, 5669 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  2m47.0s/3m30.0s

running (2m48.0s), 50/50 VUs, 5711 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  2m48.0s/3m30.0s

running (2m49.0s), 50/50 VUs, 5752 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  2m49.0s/3m30.0s

running (2m50.0s), 50/50 VUs, 5795 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m50.0s/3m30.0s

running (2m51.0s), 50/50 VUs, 5838 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m51.0s/3m30.0s

running (2m52.0s), 50/50 VUs, 5878 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m52.0s/3m30.0s

running (2m53.0s), 50/50 VUs, 5919 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  2m53.0s/3m30.0s

running (2m54.0s), 50/50 VUs, 5957 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m54.0s/3m30.0s

running (2m55.0s), 50/50 VUs, 5998 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  2m55.0s/3m30.0s

running (2m56.0s), 50/50 VUs, 6044 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  2m56.0s/3m30.0s

running (2m57.0s), 50/50 VUs, 6090 complete and 0 interrupted iterations
default   [  84% ] 50/50 VUs  2m57.0s/3m30.0s

running (2m58.0s), 50/50 VUs, 6129 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  2m58.0s/3m30.0s

running (2m59.0s), 50/50 VUs, 6167 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  2m59.0s/3m30.0s

running (3m00.0s), 50/50 VUs, 6209 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  3m00.0s/3m30.0s

running (3m01.0s), 50/50 VUs, 6246 complete and 0 interrupted iterations
default   [  86% ] 50/50 VUs  3m01.0s/3m30.0s

running (3m02.0s), 48/50 VUs, 6294 complete and 0 interrupted iterations
default   [  87% ] 48/50 VUs  3m02.0s/3m30.0s

running (3m03.0s), 46/50 VUs, 6339 complete and 0 interrupted iterations
default   [  87% ] 46/50 VUs  3m03.0s/3m30.0s

running (3m04.0s), 44/50 VUs, 6375 complete and 0 interrupted iterations
default   [  88% ] 44/50 VUs  3m04.0s/3m30.0s

running (3m05.0s), 43/50 VUs, 6410 complete and 0 interrupted iterations
default   [  88% ] 43/50 VUs  3m05.0s/3m30.0s

running (3m06.0s), 41/50 VUs, 6440 complete and 0 interrupted iterations
default   [  89% ] 41/50 VUs  3m06.0s/3m30.0s

running (3m07.0s), 40/50 VUs, 6476 complete and 0 interrupted iterations
default   [  89% ] 40/50 VUs  3m07.0s/3m30.0s

running (3m08.0s), 38/50 VUs, 6513 complete and 0 interrupted iterations
default   [  90% ] 38/50 VUs  3m08.0s/3m30.0s

running (3m09.0s), 37/50 VUs, 6548 complete and 0 interrupted iterations
default   [  90% ] 37/50 VUs  3m09.0s/3m30.0s

running (3m10.0s), 34/50 VUs, 6579 complete and 0 interrupted iterations
default   [  90% ] 34/50 VUs  3m10.0s/3m30.0s

running (3m11.0s), 34/50 VUs, 6605 complete and 0 interrupted iterations
default   [  91% ] 34/50 VUs  3m11.0s/3m30.0s

running (3m12.0s), 32/50 VUs, 6628 complete and 0 interrupted iterations
default   [  91% ] 32/50 VUs  3m12.0s/3m30.0s

running (3m13.0s), 30/50 VUs, 6655 complete and 0 interrupted iterations
default   [  92% ] 30/50 VUs  3m13.0s/3m30.0s

running (3m14.0s), 29/50 VUs, 6683 complete and 0 interrupted iterations
default   [  92% ] 29/50 VUs  3m14.0s/3m30.0s

running (3m15.0s), 26/50 VUs, 6711 complete and 0 interrupted iterations
default   [  93% ] 26/50 VUs  3m15.0s/3m30.0s

running (3m16.0s), 25/50 VUs, 6731 complete and 0 interrupted iterations
default   [  93% ] 25/50 VUs  3m16.0s/3m30.0s

running (3m17.0s), 22/50 VUs, 6750 complete and 0 interrupted iterations
default   [  94% ] 22/50 VUs  3m17.0s/3m30.0s

running (3m18.0s), 22/50 VUs, 6768 complete and 0 interrupted iterations
default   [  94% ] 22/50 VUs  3m18.0s/3m30.0s

running (3m19.0s), 20/50 VUs, 6787 complete and 0 interrupted iterations
default   [  95% ] 20/50 VUs  3m19.0s/3m30.0s

running (3m20.0s), 18/50 VUs, 6805 complete and 0 interrupted iterations
default   [  95% ] 18/50 VUs  3m20.0s/3m30.0s

running (3m21.0s), 17/50 VUs, 6820 complete and 0 interrupted iterations
default   [  96% ] 17/50 VUs  3m21.0s/3m30.0s

running (3m22.0s), 15/50 VUs, 6832 complete and 0 interrupted iterations
default   [  96% ] 15/50 VUs  3m22.0s/3m30.0s

running (3m23.0s), 13/50 VUs, 6845 complete and 0 interrupted iterations
default   [  97% ] 13/50 VUs  3m23.0s/3m30.0s

running (3m24.0s), 11/50 VUs, 6858 complete and 0 interrupted iterations
default   [  97% ] 11/50 VUs  3m24.0s/3m30.0s

running (3m25.0s), 10/50 VUs, 6867 complete and 0 interrupted iterations
default   [  98% ] 10/50 VUs  3m25.0s/3m30.0s

running (3m26.0s), 07/50 VUs, 6877 complete and 0 interrupted iterations
default   [  98% ] 07/50 VUs  3m26.0s/3m30.0s

running (3m27.0s), 07/50 VUs, 6883 complete and 0 interrupted iterations
default   [  99% ] 07/50 VUs  3m27.0s/3m30.0s

running (3m28.0s), 06/50 VUs, 6885 complete and 0 interrupted iterations
default   [  99% ] 06/50 VUs  3m28.0s/3m30.0s

running (3m29.0s), 04/50 VUs, 6891 complete and 0 interrupted iterations
default   [ 100% ] 04/50 VUs  3m29.0s/3m30.0s

running (3m30.0s), 02/50 VUs, 6895 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  3m30.0s/3m30.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=292.21ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6897    32.755015/s
    checks_succeeded...: 100.00% 6897 out of 6897
    checks_failed......: 0.00%   0 out of 6897

    ✓ status is 200 or 201

    HTTP
    http_req_duration..............: avg=201.51ms min=99.8ms med=201.55ms max=308.01ms p(90)=282.43ms p(95)=292.21ms
      { expected_response:true }...: avg=201.51ms min=99.8ms med=201.55ms max=308.01ms p(90)=282.43ms p(95)=292.21ms
    http_req_failed................: 0.00%  0 out of 6897
    http_reqs......................: 6897   32.755015/s

    EXECUTION
    iteration_duration.............: avg=1.2s     min=1.1s   med=1.2s     max=1.3s     p(90)=1.28s    p(95)=1.29s   
    iterations.....................: 6897   32.755015/s
    vus............................: 2      min=1         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 2.0 MB 9.7 kB/s
    data_sent......................: 2.7 MB 13 kB/s



running (3m30.6s), 00/50 VUs, 6897 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  3m30s